InformationRegisters/КР_ПриемкаПеремещенийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ПриемкаПеремещенийТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПотоварнойПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НеФормироватьАктОРасхождениях</Name>
					<Comment>JIRA№ A2105505-1769</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОбработка</Name>
					<Comment>JIRA№ A2105505-2046</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Накладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ПриемкаПеремещенийТоваров/Forms/ФормаСписка/Ext/Form/Module.bsl
// 26.07.2023 Марченко С.Н., КРОК, JIRA№A2105505-2046

&НаКлиенте
Процедура УстановитьПризнакОтложеннаяОбработка(Команда)
	
	ЭлементСписок = Элементы.Список;
	
	МассивНакладных = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ЭлементСписок.ВыделенныеСтроки Цикл  
		ДанныеСтроки = ЭлементСписок.ДанныеСтроки(ИдентификаторСтроки);
		МассивНакладных.Добавить(ДанныеСтроки.Накладная);	
	КонецЦикла;

	ОбработатьЗаписиНаСервере(МассивНакладных); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры       

&НаСервере
Процедура ОбработатьЗаписиНаСервере(МассивНакладных)

	МереджерРегистра = РегистрыСведений.КР_ПриемкаПеремещенийТоваров;
	НаборЗаписей = МереджерРегистра.СоздатьНаборЗаписей(); 
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтложеннаяОбработка", 
		КР_ДополнительныеНастройкиПовтИсп.БазаЯвляетсяЦентральной());
		
	Для Каждого Накладная Из МассивНакладных Цикл 
			
		НаборЗаписей.Отбор.Накладная.Установить(Накладная);		  
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
					
		НаборЗаписей.Записать();
			
	КонецЦикла;
		
КонецПроцедуры
